{
  "intents": [
    {
      "tag": "greeting",
      "patterns": ["hello", "hi", "hey", "good morning", "good afternoon", "namaste"],
      "responses": [
        "Namaste! How can I assist you with rice cultivation today?",
        "Hello! I'm here to help with rice farming questions.",
        "Hi there! Ask me anything about rice crop management."
      ]
    },
    {
      "tag": "rice_varieties",
      "patterns": ["rice variety", "varieties", "which rice", "best rice", "rice types", "paddy variety"],
      "responses": [
        "Popular rice varieties in India: Basmati 370, Pusa 1121, IR-64, Swarna, Samba Mahsuri. Choose based on your region, soil type, and market demand.",
        "For disease resistance, consider varieties like Improved Samba Mahsuri (resistant to bacterial blight) or Improved Pusa Basmati (resistant to blast)."
      ]
    },
    {
      "tag": "rice_fertilizer",
      "patterns": ["fertilizer for rice", "rice fertiliser", "npk for rice", "rice nutrients", "paddy fertilizer"],
      "responses": [
        "Rice requires NPK in ratio 120:60:40 kg/ha. Apply nitrogen in 3 splits: 50% basal, 25% at tillering, 25% at panicle initiation. Add zinc sulfate (25 kg/ha) if soil is deficient.",
        "Use organic manures like FYM (12-15 tons/ha) before planting. Apply green manure crops (dhaincha, sesbania) for better soil health."
      ]
    },
    {
      "tag": "rice_irrigation",
      "patterns": ["rice water", "irrigation rice", "watering paddy", "water management", "paddy water"],
      "responses": [
        "Maintain 5-7 cm water level during tillering and flowering stages. Practice Alternate Wetting and Drying (AWD) to save 30% water. Drain field 10-15 days before harvest.",
        "Critical water stages: transplanting, tillering, flowering, and grain filling. Avoid water stress during these stages for better yield."
      ]
    },
    {
      "tag": "rice_diseases",
      "patterns": ["rice disease", "disease in paddy", "rice problems", "unhealthy rice", "paddy disease"],
      "responses": [
        "Common rice diseases: Blast, Bacterial Leaf Blight, Brown Spot, Tungro. Upload an image to our system for accurate diagnosis and treatment recommendations.",
        "Preventive measures: Use certified seeds, maintain proper spacing, avoid excessive nitrogen, ensure good drainage, and practice crop rotation."
      ]
    },
    {
      "tag": "blast_disease",
      "patterns": ["blast", "neck blast", "leaf blast", "blast fungus"],
      "responses": [
        "Blast is caused by fungus Magnaporthe oryzae. Spray Tricyclazole 75% WP (0.6g/L) or Carbendazim 50% WP (1g/L). Apply at tillering, booting, and flowering stages.",
        "Prevention: Use resistant varieties, avoid excessive nitrogen, practice alternate wetting and drying, and apply silicon-based fertilizers."
      ]
    },
    {
      "tag": "bacterial_blight",
      "patterns": ["bacterial blight", "leaf blight", "blight disease", "kresek"],
      "responses": [
        "Bacterial Leaf Blight is caused by Xanthomonas oryzae. Spray Copper Oxychloride (3g/L) or Streptocycline (100 ppm). Remove and destroy infected plants.",
        "Use resistant varieties like Improved Samba Mahsuri. Maintain balanced fertilization and proper water management. Avoid injury to plants."
      ]
    },
    {
      "tag": "tungro",
      "patterns": ["tungro", "yellow dwarf", "viral disease rice", "leafhopper disease"],
      "responses": [
        "Tungro is transmitted by green leafhopper. No direct cure - remove infected plants immediately. Control vector using Imidacloprid 17.8% SL (0.5ml/L).",
        "Prevention: Use tungro-resistant varieties, avoid staggered planting, control leafhopper population with neem oil and light traps."
      ]
    }
  ]
}
